 # <font color='darkblue'>*Marina Napoleão - EBAC*</font> 
 ## <font color='darkblue'>Projeto Final do Aprofundamento de Analytics</font>

ANOTAÇÕES

* <font color='GREEN'>COLUNAS</font> SÃO INFORMADAS PREVIAMENTE
* <font color='GREEN'>TABELAS</font> SÃO INFORMADAS PREVIAMENTE
* <font color='ORANGE'>AS</font> RENOMEIA A COLUNA
* <font color='PURPLE'>COLUNA SEMELHANTE</font> É A COLUNA QUE TEM NAS DUAS TABELAS
* A ESTRUTURA <font color='BLUE'>'FROM', 'JOIN' E 'ON'</font> NÃO PODE SER SEPARADA
* <font color='RED'>GROUP BY</font> AGRUPA DE ACORDO COM A <font color='DARKBLUE'>COLUNA SELECIONADA</font> 
* <font color='RED'>ORDER BY </font> ORNDENA DE ACORDO COM A <font color='DARKBLUE'>COLUNA SELECIONADA</font> E A CONDIÇÃO
* <font color='GRAY'>DESC</font> = DECRESCENTE  <font color='GRAY'>ASC</font> = CRESCENTE


conn = sqlite3.connect(' ')

query = """

<font color='BLACK'>SELECT</font>

<font color='GREEN'>COLUNA</font>.A <font color='ORANGE'>AS</font> NOVO_NOME

<font color='GREEN'>COLUNA</font>.B <font color='ORANGE'>AS</font> NOVO_NOME

<font color='blue'>FROM</font> <font color='GREEN'>TABELA_1</font> AS A

<font color='blue'>INNER JOIN</font> <font color='GREEN'>TABELA_2</font> AS B

<font color='blue'>ON</font> A.<font color='PURPLE'>COLUNA SEMELHANTE</font> = B.<font color='PURPLE'>COLUNA SEMELHANTE</font>

<font color='RED'>GROUP BY</font> <font color='DARKBLUE'>COLUNA_SELECIONADA</font> 

<font color='RED'>ORDER BY</font> <font color='DARKBLUE'>COLUNA SELECIONADA</font>  <font color='GRAY'>DESC OU ASC</font>


"""

df = pd.read_sql(query, conn)

df

# **MÓDULO 26 - Projeto Final do Aprofundamento de Analytics**

Bem-vindos ao Projeto de Dashboard de E-commerce! Este projeto é uma oportunidade para vocês aplicarem habilidades essenciais de análise de dados em um cenário prático e realista. Vocês irão trabalhar com um conjunto de dados de transações de clientes de uma loja virtual, distribuídos em duas tabelas distintas. O objetivo final é construir um dashboard interativo que facilite a visualização e análise das informações relevantes do e-commerce, utilizando ferramentas como Looker Studio ou Power BI.

**Objetivo do Projeto:**

Tratamento de Dados: Realizar a junção (JOIN) de duas tabelas utilizando SQL para consolidar as informações.
Análise de Dados: Exportar os dados resultantes para um arquivo CSV.
Visualização de Dados: Desenvolver um dashboard interativo e informativo para visualização das principais métricas e insights do e-commerce.

**Tabelas Disponibilizadas:**

**Tabela de Transações:** Contém os registros de transações realizadas pelos clientes, incluindo detalhes como ID da transação, valor e outros.


**Tabela de Dados Pessoais:** Contém as informações pessoais dos clientes, como ID do cliente, nome, genero, cidade, etc.

**Chave de Ligação:** As tabelas se relacionam através da coluna ID_CLIENT, que é a chave identificadora dos clientes.

# Etapas do Projeto:

1. Realizar um JOIN SQL nas duas tabelas, unificando as informações através da coluna ID_CLIENT. Você deve justificar a escolha do JOIN (Inner/ Left/ Right ou Full).

2. Exportar os dados consolidados resultantes do JOIN para um arquivo CSV.

3. Utilizar Looker Studio ou Power BI para importar o arquivo CSV.

4. Criar visualizações interativas que apresentem métricas importantes, como total de vendas, número de transações, distribuição geográfica dos clientes, perfil demográfico dos clientes, entre outros.

Abaixo temos a configuração do ambiente SQL:

In [1]:
import sqlite3
import pandas as pd

C:\Users\marina\anaconda3\lib\site-packages\pandas\core\computation\expressions.py:21: UserWarning: Pandas requires version '2.8.4' or newer of 'numexpr' (version '2.8.3' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED
C:\Users\marina\anaconda3\lib\site-packages\pandas\core\arrays\masked.py:61: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
df_transacoes = pd.read_csv("TB_TRANSACOES_PROJETO_ECOMM.csv", delimiter=';')
df_clientes = pd.read_csv("TB_CLIENTES_PROJETO_ECOMM.csv", delimiter=';')

In [3]:
conn = sqlite3.connect('projeto.db')
# Carregar o DataFrame no banco de dados SQLite - criando tb_transacoes e tb_clientes
df_transacoes.to_sql('tb_transacoes', conn, index=False, if_exists='replace')
df_clientes.to_sql('tb_clientes', conn, index=False, if_exists='replace')

175

In [4]:
# Função para executar consultas SQL e retornar o resultado como um DataFrame
def run_query(query):
    return pd.read_sql_query(query, conn)

In [5]:
#COLUNA TB_CLIENTES
conn = sqlite3.connect('projeto.db')
query = """
SELECT
*
FROM TB_CLIENTES
"""

df = pd.read_sql(query, conn)
df

    state_name First_name   Gender                     Job_Title  Id_client
0           TX    Domingo     Male  Structural Analysis Engineer          1
1           MI    Russell     Male            Speech Pathologist          2
2           AL     Kimble     Male           Account Coordinator          3
3           IL   Barnabas     Male               General Manager          4
4           MN     Tanney   Female                  VP Marketing          5
..         ...        ...      ...                           ...        ...
170         UT  Fairleigh     Male    Desktop Support Technician        171
171         DC    Lambert  Agender             Chemical Engineer        172
172         NY      Jacob     Male      Senior Financial Analyst        173
173         OK        Pip     Male         Chief Design Engineer        174
174         OR     Murvyn   Female          Safety Technician IV        175

[175 rows x 5 columns]

In [6]:
#COLUNA TB_TRANSACOES
conn = sqlite3.connect('projeto.db')
query = """
SELECT
*
FROM TB_TRANSACOES
"""
df = pd.read_sql(query, conn)
df

     id_client     Category   Price   Card Type
0           37  Electronics   72,93  mastercard
1           38      Jewelry  121,89  mastercard
2           39         Baby    64,3  mastercard
3           40     Outdoors    9,48  mastercard
4            5     Outdoors   61,95  mastercard
..         ...          ...     ...         ...
362        363      Jewelry   44,32  mastercard
363        364         Kids  120,42  mastercard
364        365      Grocery   24,31  mastercard
365        366        Tools  111,53  mastercard
366        367    Computers   84,57  mastercard

[367 rows x 4 columns]

In [7]:
# COLUNAS TB_CLIENTES + TB_TRANSACOES
query_completa = """
SELECT DISTINCT
A.*,
B.*
FROM TB_CLIENTES AS A
FULL JOIN TB_TRANSACOES AS B
ON A.id_client = B.id_client
"""
df_completa = run_query(query_completa)
print(df_completa)

    state_name First_name  Gender                     Job_Title  Id_client  \
0           TX    Domingo    Male  Structural Analysis Engineer        1.0
1           MI    Russell    Male            Speech Pathologist        2.0
2           AL     Kimble    Male           Account Coordinator        3.0
3           IL   Barnabas    Male               General Manager        4.0
4           MN     Tanney  Female                  VP Marketing        5.0
..         ...        ...     ...                           ...        ...
367       None       None    None                          None        NaN
368       None       None    None                          None        NaN
369       None       None    None                          None        NaN
370       None       None    None                          None        NaN
371       None       None    None                          None        NaN

     id_client   Category   Price   Card Type
0          1.0   Outdoors   16,97  mastercard
1          2.0    Grocery  143,39  mastercard
2          3.0      Music   37,64  mastercard
3          4.0    Jewelry    8,51  mastercard
4          5.0   Outdoors   61,95  mastercard
..         ...        ...     ...         ...
367      363.0    Jewelry   44,32  mastercard
368      364.0       Kids  120,42  mastercard
369      365.0    Grocery   24,31  mastercard
370      366.0      Tools  111,53  mastercard
371      367.0  Computers   84,57  mastercard

[372 rows x 9 columns]

In [8]:
# COLUNAS TB_CLIENTES + TB_TRANSACOES COM VALORES FALTANTES
conn = sqlite3.connect('projeto.db')
query_faltantes = """
SELECT DISTINCT
*
FROM TB_CLIENTES AS A
FULL OUTER JOIN TB_TRANSACOES AS B
ON A.id_client = B.id_client
WHERE A.id_client IS NULL OR B.id_client IS NULL
"""
df_faltantes = run_query(query_faltantes)
print(df_faltantes)

   state_name First_name  Gender          Job_Title  Id_client  id_client  \
0          CT        Les  Female   Junior Executive       80.0        NaN
1          IL     Kilian    Male    Design Engineer       81.0        NaN
2          NC     Donall    Male  Web Developer III       82.0        NaN
3          CA    Hershel    Male              Nurse       83.0        NaN
4          IL   Demetris    Male      Social Worker       84.0        NaN
..        ...        ...     ...                ...        ...        ...
71       None       None    None               None        NaN      363.0
72       None       None    None               None        NaN      364.0
73       None       None    None               None        NaN      365.0
74       None       None    None               None        NaN      366.0
75       None       None    None               None        NaN      367.0

     Category   Price   Card Type
0        None    None        None
1        None    None        None
2        None    None        None
3        None    None        None
4        None    None        None
..        ...     ...         ...
71    Jewelry   44,32  mastercard
72       Kids  120,42  mastercard
73    Grocery   24,31  mastercard
74      Tools  111,53  mastercard
75  Computers   84,57  mastercard

[76 rows x 9 columns]

 * <font color='darkblue'> 'A.id_client = valores preenchidos' + 'B.id_client = nulos' → clientes sem transações.</font>
 * <font color='darkblue'>'A.id_client = nulo' + 'B.id_client = preenchido' → transações sem cliente cadastrado.</font>

In [9]:
# COLUNAS TB_CLIENTES + TB_TRANSACOES SEM VALORES FALTANTES
conn = sqlite3.connect('projeto.db')
query_consolidada = """
SELECT DISTINCT
*
FROM TB_CLIENTES AS A
INNER JOIN TB_TRANSACOES AS B
ON A.id_client = B.id_client
WHERE A.id_client IS NOT NULL AND B.id_client IS NOT NULL
"""

df_consolidada = run_query(query_consolidada)
print(df_consolidada)

    state_name First_name   Gender                     Job_Title  Id_client  \
0           TX    Domingo     Male  Structural Analysis Engineer          1
1           MI    Russell     Male            Speech Pathologist          2
2           AL     Kimble     Male           Account Coordinator          3
3           IL   Barnabas     Male               General Manager          4
4           MN     Tanney   Female                  VP Marketing          5
..         ...        ...      ...                           ...        ...
291         UT  Fairleigh     Male    Desktop Support Technician        171
292         DC    Lambert  Agender             Chemical Engineer        172
293         NY      Jacob     Male      Senior Financial Analyst        173
294         OK        Pip     Male         Chief Design Engineer        174
295         OR     Murvyn   Female          Safety Technician IV        175

     id_client    Category   Price   Card Type
0            1    Outdoors   16,97  mastercard
1            2     Grocery  143,39  mastercard
2            3       Music   37,64  mastercard
3            4     Jewelry    8,51  mastercard
4            5     Grocery   28,42  mastercard
..         ...         ...     ...         ...
291        171       Books   35,85  mastercard
292        172  Automotive  130,08  mastercard
293        173        Kids   28,38  mastercard
294        174      Sports   36,35  mastercard
295        175        Kids  141,71  mastercard

[296 rows x 9 columns]

Justifique a escolha do JOIN:

* <font color='darkblue'> Foi utilizado o 'FULL JOIN', pois o objetivo da tabela é consolidar todas as informações, tendo dados faltantes ou não.</font>


* <font color='darkblue'> Para criar uma tabela em que há 'id_cliente' faltando dados, foi usado o 'FULL OUTER JOIN' em ambas as colunas com o filtro 'WHERE A.id_client IS NOT NULL AND B.id_client IS NOT NULL' para conseguir visualizar somente os clientes que estão com valores faltantes.</font>


* <font color='darkblue'> Em uma nova tabela, para visualizar somente os 'id_cliente' com dados, foi usado o 'INNER JOIN' com um filtro diferente 'WHERE A.id_client IS NOT NULL AND B.id_client IS NOT NULL'. Assim a tabela só traz os 'id_cliente' completos.</font>

Exportando o arquivo como CSV:

In [10]:
df_consolidada = pd.read_sql(query_consolidada, conn)

df_consolidada.to_csv('dados_consolidados.csv', index=False, encoding='utf-8-sig')

print("Arquivo 'dados_consolidados.csv' exportado com sucesso!")

Arquivo 'dados_consolidados.csv' exportado com sucesso!

In [11]:
df_faltantes = pd.read_sql(query_faltantes, conn)

df_faltantes.to_csv('dados_faltantes.csv', index=False, encoding='utf-8-sig')

print("Arquivo 'dados_faltantes.csv' exportado com sucesso!")

Arquivo 'dados_faltantes.csv' exportado com sucesso!

In [12]:
df_completa = pd.read_sql(query_completa, conn)

df_completa.to_csv('dados_completos.csv', index=False, encoding='utf-8-sig')

print("Arquivo 'dados_completos.csv' exportado com sucesso!")

Arquivo 'dados_completos.csv' exportado com sucesso!

In [13]:
conn.close()
print("Conexão com o banco encerrada.")

Conexão com o banco encerrada.

<font color='darkblue'>POWER BI:</font>

<font color='darkblue'>✅Total de vendas</font>

<font color='darkblue'>✅Tabela de quantidade de clientes e total de vendas por estados  </font>

<font color='darkblue'>✅Número de clientes ativos</font>

<font color='darkblue'>✅Média dos preços</font>

<font color='darkblue'>✅Vendas por categoria de produto</font>

<font color='darkblue'>✅Ranking das categorias mais compradas</font>

<font color='darkblue'>✅Distribuição por profissão</font>

**Dicas para o projeto:**
- Se atente que, como o mesmo cliente realiza mais de 1 transação quando você for trazer alguma métrica relacionada a dados do cliente terá que utilizar o distinct para criar essas métricas no dashboard, se não acabará tendo os dados repetidos.

- Análise sua tabela, entenda a dimensão dos dados, no excel, antes de enviar para o Powerbi ou Looker Studio.

- Tente montar preveamente um roteiro de quais métricas e visualizações irá colocar no dashboard, isso tornará seu processo mais rápido.

- Qualquer dificuldade para subir sua base para as ferramentas de visualização envie a base e o erro encontrado para que os tutores possam te ajudar.